<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
<title>Ricardo H.B. | Proyectos</title>
<link href="css/main.css" rel="stylesheet" type="text/css">
<script type="text/javascript" src="js/main.js"></script>
</head>
<body>
<script type="text/javascript" src="js/top.js"></script>
<div id="wrapper"><!-- start wrapper div -->
 <div class="tb"></div><!-- separator div -->
	<div class="head_wrapper"><!-- start head wraper -->
		<div id="menu">
		<br>
			<ul>
				<li><a href="proyectos.html">Proyectos &raquo;</a></li>
			</ul>
		</div>
	</div><!-- end head wrapper -->
	<table id="content" width="100%" border="0" cellspacing="0" cellpadding="0">
		<tr>
			<td width="100%" align="left" valign="top" class="content_right"><div class="content_middle">
				<img src="img/affidavit.jpg" width="960" height="286">
				<h2>Proyecto Affidavit Consulting</h2>
				<p>La empresa espa&ntilde;ola Affidavit Consulting, dedicada a la gesti&oacute;n de activos mediante la venta de bienes y derechos, a trav&eacute;s de la agencia Eslogico inicia el proyecto de construcci&oacute;n de su sitio web, el cual tiene como objetivo mostrar al p&uacute;blico en general el &aacute;mplio cat&aacute;logo de activos, disponibles para su adquisici&oacute;n mediante subasta o venta directa.</p>
				<div class="clear"></div>
				<p><img style="margin:10px 15px;float:left;" align="top" src="img/aff_0.jpg" width="459" height="305">Mi participaci&oacute;n en el proyecto tiene lugar en dos fases principales del desarrollo:</p>
				<h3>Dise&ntilde;o (look&amp;feel).</h3>
				<p>Se realizaron 2 propuestas de dise&ntilde;o distintas para el proyecto, de las cuales la m&iacute;a result&oacute; la aprobada para la producci&oacute;n. Las caracter&iacute;sticas destacables de esta propuesta son:</p>
				<ul>
					<li>Dise&ntilde;o l&iacute;mpido y despejado, con suficiente espacio entre separaciones.</li>
					<li>Se tomaron en cuenta los sitios web de la competencia, para mejorar detalles de la interfaz.</li>
					<li>Se respetan los colores y tipograf&iacute;a de la imagen corporativa de la empresa.</li>
					<li>Integra un interfaz que facilita el proceso de subasta o compra para el usuario.</li>
					<li>Layout f&aacute;cilmente adaptable para el uso de sistemas multilenguaje.</li>
				</ul>
				<p>Una vez aprobado el dise&ntilde;o se incorpor&oacute; el mismo en un framework a modo de template.</p>
				<div class="clear"></div>
				<img style="margin:10px 15px;float:right;" align="top" src="img/aff_1.jpg" width="459" height="305">
				<h3> &nbsp; &nbsp; Programaci&oacute;n (framework: <a href="sdu.html">SDU</a>).</h3>
				<p>La programaci&oacute;n consiti&oacute; en el desarrollo de un framework o back-end, que permitiera gestionar el contenido del sitio as&iacute; como los distintos sistemas que funcionar&iacute;an en conjunto,	que	son:</p>
				<h4>Gesti&oacute;n de contenido</h4>
<p>La idea era facilitar la gesti&oacute;n del contenido fijo del sitio; Im&aacute;genes, copys, animaciones, etc. con la finalidad de permitir la adici&oacute;n de contenido de la forma m&aacute;s sencilla.	Para	lograrlo	hice uso del sistema <a href="sdu.html">SDU</a> programado en PHP, el cual ya hab&iacute;a tenido muy buen desempe&ntilde;o en la gesti&oacute;n de campa&ntilde;as de &aacute;mplio alcance como las de Sorteo Tec. <a href="sdu.html">SDU</a> permiti&oacute; agregar contenido al sitio web como un archivo de HTML simple, el cual es incorporado por el sistema, se le asigna un t&iacute;tulo y finalmente se le integra el look&amp;feel general del sitio mediante CSS y PHP, todo lo anterior sucede de forma autom&aacute;tica.</p>
<h4>Sistema de usuarios</h4>
<p><a href="sdu.html">SDU</a> fu&eacute;, como su nombre lo dice, originalmente programado como un sistema de usuarios, al cual he ido agregando funcionalidad con el paso del tiempo, sin perder su objetivo original, el de gestionar una cantidad N de usuarios. <a href="http://www.affidavitconsulting.com" target="_blank">affidavitconsulting.com</a> utiliza una versi&oacute;n modificada de <a href="sdu.html">SDU</a> para gestionar su base de usuarios. La modificaci&oacute;n tuvo que realizarse ya que el sistema de forma nativa ten&iacute;a s&oacute;lo soporte para conexi&oacute;n con bases de datos MySQL que es casi un est&aacute;ndar en servidores por su penetraci&oacute;n, sin embargo la base de datos del cliente es una instancia de MSSQL, por lo que tuvieron que realizarse cambios en el sistema de conexi&oacute;n para agregar soporte al tipo de BDD.</p>
<div class="clear"></div>
<img style="margin:10px 15px;float:left;" align="top" src="img/aff_2.jpg" width="459" height="305">
<h4>Sistema multilenguaje</h4>
<p><a href="sdu.html">SDU</a> a la fecha no cuenta con soporte multilenguaje. El desarrollo de un sistema multilenguaje era imperativo para el proyecto, ya que el alcance de potenciales clientes de Affidavit Consulting comprende a casi toda la Uni&oacute;n Europea. En este caso se realiz&oacute; un trabajo de programaci&oacute;n exclusivo, el cual tuvo como objetivo, adem&aacute;s de la traducci&oacute;n autom&aacute;tica entre lenguajes, permitir la especificaci&oacute;n de t&eacute;rminos legales.</p>
<p>El desarrollo comprende &eacute;stos sistemas entre otros y ha sido uno de los proyectos en los que m&aacute;s me ha gustado participar.</p>
<p><a target="_blank" style="text-decoration:none;" href="http://www.affidavitconsulting.com" class="btn">Visitar sitio web</a></p>
			</div>
			
			</td>
		</tr>
	</table>
</div><!-- end wrapper div -->
<script type="text/javascript" src="js/footer.js"></script>
</body>
</html>
